# This file is generated by Anlogic Timing Wizard. 29 09 2020

#Created Clock
create_clock -name i_clk -period 40 -waveform {0 20} [get_ports {i_clk}]

#Set Clock Uncertainty
set_clock_uncertainty 0.2  [get_clocks {i_clk}]

#Set False Path
#set_false_path  -from [get_clocks {i_clk_24Mhz}] -to [get_clocks {i_clk}]
